Предполагается, что в рамках данного задания ученики сами будут изучать документацию, как минимум используя функционал `tab` и `shift+tab` от Jupyter

1. Импортируйте библиотеку pandas 
2. Считайте файл `wage.csv` в DataFrame с названием `wage`. Используйте для этого функцию pd.read_csv()

`person_id` - идентификатор человека

`gender` - пол, 0 - женский, 1 - мужской

`wage` - заработная плата в рублях

In [3]:
import pandas as pd
df = pd.read_csv('wage.csv')

3. Поменяйте колонку `gender` так, чтобы были записи `F` (female) и `M` (male) вместо 0 и 1

In [4]:
df.gender = df.gender.replace({0: "F", 1: "M"})
df.sample(10)

     person_id gender           wage
380        374      F   15970.556060
142        136      M  137819.975385
348        342      M   12461.850062
506        500      M   15645.611053
85          79      F   37685.091805
410        404      M    6343.857022
417        411      M   19008.310571
585        579      F   13256.903016
724        718      F   12410.187880
858        852      F    6711.484104

4. Давайте посчитаем среднюю зарплату у мужчин и женщин. Для этого используйте метод `groupby` со следующим синтаксисом:

`dataframe.groupby(Название_колонки_для_группировки)[Перечисление_колонок_для_агрегации].функция_агрегации()`

In [5]:
df.groupby('gender')['wage'].mean()

gender
F    40855.747261
M    46815.944005
Name: wage, dtype: float64

5. Теперь взглянем внимательнее на данные и обнаружим, что некоторые люди попали в выборку несколько раз. 
    1. Найдите таких людей. Подсказка: `value_counts()`
    0. Убедитесь, что записи по ним с одинаковым `wage`. Возможно, тут вам пригодится функция агрегации `nunique()`, отображающая количество разных значений
    0. Избавьтесь от повторяющихся значений. Подсказка: `drop_duplicates()`

In [6]:
print(df.wage.nunique())

1000

In [7]:
df = df.drop_duplicates()

In [8]:
df.wage.value_counts()

wage
108107.141368    1
46793.603811     1
33481.575720     1
44523.699084     1
15995.576829     1
                ..
3249.605291      1
23547.663281     1
273483.609236    1
13434.655493     1
68341.332163     1
Name: count, Length: 1000, dtype: int64

6. Теперь посмотрим внимательнее на зарплаты
    1. Охарактеризуйте имеющиеся данные по зарплатам. Подсказка: `describe`
    1. Избавьтесь от бессмысленных значений

In [9]:
df.describe()

         person_id           wage
count  1000.000000    1000.000000
mean    499.500000   43694.227404
std     288.819436   55352.539343
min       0.000000 -287418.645743
25%     249.750000   14489.682367
50%     499.500000   27309.529498
75%     749.250000   52021.080258
max     999.000000  755320.874132

In [10]:
df = df[df['wage'] >= 0]

In [11]:
df.dropna()

      person_id gender           wage
0             0      M   46793.603811
1             1      M   33481.575720
2             2      M   44523.699084
3             3      M   15995.576829
4             4      F   10282.631224
...         ...    ...            ...
1001        995      M   66503.737185
1002        996      M    9972.956272
1003        997      F  104504.616392
1004        998      M   98927.903076
1005        999      M  108107.141368

[995 rows x 3 columns]

7. Давайте теперь посмотрим на зарплату с учетом бонуса. Для этого нам понадобится таблица `bonus.csv`. Считайте ее в переменную `bonus`. Заметьте, что она сохранена немного в другом формате, и вам понадобится уточнить параметр `sep` - разделитель записей. Сравните текущий файл с предыдущим и попробуйте решить проблему

In [12]:
bonus = pd.read_csv('bonus.csv', sep = ';')
bonus.head(5)

   person_id          bonus
0        905   85059.638382
1        836    7703.346074
2        287    3120.269742
3        548    5347.987142
4        575  137257.490614

8. Чтобы посчитать итоговую зарплату, нам нужно по каждому человеку знать и оклад, и премию. Для этого надо будет соединить (сджойнить) таблицы по `person_id`. Используйте для этого функцию `pd.merge`. Помните, что параметр `how` должен быть `'outer'`, чтобы сохранить те записи, что есть только в одной таблице. Результат запишите в новый dataframe `df`

In [13]:
dff = pd.merge(df, bonus, on='person_id', how='outer')

In [19]:
dff

     person_id gender           wage         bonus
0            0      M   46793.603811  3.332934e+04
1            1      M   33481.575720  0.000000e+00
2            2      M   44523.699084  3.192912e+06
3            3      M   15995.576829  2.196858e+04
4            4      F   10282.631224  0.000000e+00
..         ...    ...            ...           ...
994        995      M   66503.737185  3.452137e+03
995        996      M    9972.956272  3.892790e+05
996        997      F  104504.616392  5.380978e+04
997        998      M   98927.903076  0.000000e+00
998        999      M  108107.141368  0.000000e+00

[999 rows x 4 columns]

9. Наконец, давайте посчитаем итоговую зарплату
    1. Замените отсутствующие записи в колонке `bonus` нулями
    1. Уберите людей без `wage` - это те "плохие" записи, от которых мы избавлялись на предыдущих шагах
    1. Сделайте новую колонку `total`, которая будет равна 12 окладам и премии
    1. Посчитайте среднюю и медианную итоговую зарплату в разрезе по полу. Подсказка: вместо функции агрегации можно написать `.agg()` и перечислить внутри нужные агрегаты

In [18]:
dff['bonus'] = dff['bonus'].fillna(0)

In [30]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
Index: 997 entries, 0 to 998
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   person_id  997 non-null    int64
 1   gender     997 non-null    object
 2   wage       997 non-null    float64
 3   bonus      997 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 38.9+ KB

In [29]:
dff = dff.dropna(subset=['wage'])

In [36]:
dff['total'] = (dff['wage'] * 12) + dff['bonus']

In [35]:
aver_med = dff.groupby('gender')['total'].agg(['mean', 'median'])
aver_med

                 mean         median
gender
F       570746.139432  347622.913892
M       657142.490282  437499.824868

In [37]:
dff.describe()

        person_id           wage         bonus         total
count  997.000000     997.000000  9.970000e+02  9.970000e+02
mean   500.863591   44255.182604  8.344539e+04  6.145076e+05
std    288.181533   54260.428463  3.755586e+05  7.504139e+05
min      0.000000     945.648458  0.000000e+00  1.375512e+04
25%    252.000000   14677.625229  0.000000e+00  2.049945e+05
50%    501.000000   27365.332097  0.000000e+00  3.842013e+05
75%    750.000000   52042.472920  2.437830e+04  7.411588e+05
max    999.000000  755320.874132  6.329445e+06  9.063850e+06

10. Сохраните `df` в файл, используя метод `to_csv()`. Не записывайте индексы

In [38]:
dff.to_csv('out1.csv', index = 'False')